In [141]:
#Importando Pandas
import pandas as pd

In [142]:
#Armazenando dados em um dataframe.
transacao = pd.read_excel("dataset/transacao.xlsx")
contrato = pd.read_excel("dataset/contrato.xlsx")

In [143]:
#Analise inicial de conteudo dos DF's

transacao.head()

   transaction_id  client_id  total_amount  discount_percentage
0               1       3545          3000                 0.99
1               2       3545          4500                 0.45
2               3       3509         69998                 0.00
3               4       3510             1                  NaN
4               5       4510            34                40.00

In [144]:

contrato.head()

   contract_id  client_id      client_name  percentage  is_active
0            3       3545   Magazine Luana        2.00       True
1            4       3545   Magazine Luana        1.95      False
2            5       3509  Lojas Italianas        1.00       True
3            6       3510       Carrerfive        3.00       True

In [148]:
#teratar nulos
transacao['discount_percentage'].fillna(0,inplace=True)

In [149]:
#Criar vl liqudio
transacao['vl_liquido'] = transacao['total_amount'] * ((100 - transacao['discount_percentage'] )/100)

In [206]:
#retirar inativos
contrato = contrato[contrato['is_active']==True]
contrato.head()

   contract_id  client_id      client_name  percentage  is_active
0            3       3545   Magazine Luana         2.0       True
2            5       3509  Lojas Italianas         1.0       True
3            6       3510       Carrerfive         3.0       True

In [207]:
#Merge de data frames
df = pd.merge(transacao,contrato,on='client_id')

In [208]:
df['vl_final'] =  df['vl_liquido'] * (df['percentage']/100)

In [209]:
df.head()

,transaction_id,client_id,total_amount,discount_percentage,vl_liquido,contract_id,client_name,percentage,is_active,vl_final
0,1,3545,3000,0.99,2970.30,3,Magazine Luana,2.0,True,59.406
1,2,3545,4500,0.45,4479.75,3,Magazine Luana,2.0,True,89.595
2,3,3509,69998,0.00,69998.00,5,Lojas Italianas,1.0,True,699.980
3,4,3510,1,0.00,1.00,6,Carrerfive,3.0,True,0.030